gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
/**
 * @file sd_card.c
 * @author Gian Barta-Dougall
 * @brief This file handles all data being read from or written to the SD card.
 * The current features that this library supports are:
 * -
 * @version 0.1
 * @date 2023-01-12
 * @copyright Copyright (c) 2023
 *
 */

/* Library Includes */
#include <dirent.h>
#include <sys/stat.h>
#include <sys/types.h>
#include "driver/uart.h"

/* Personal Includes */
#include "rtc.h"
#include "sd_card.h"
#include "chars.h"
#include "hardware_config.h"
#include "esp32_uart.h"
#include "ds18b20.h"
#include "datetime.h"

#include "uart_comms.h"
#include "watchdog_defines.h"

/* Private Macros */

#define LOG_MSG_MAX_CHARACTERS 200
#define NULL_CHAR_LENGTH       1
#define DATE_TIME_DELIMITER    '_'
#define IMG_NUM_START_INDEX    3
#define IMG_NUM_END_CHARACTER  '-'

#define SD_CARD_FILE_READ  0
#define SD_CARD_FILE_WRITE 1

#define MAX_PATH_LENGTH 280

static const char* SD_CARD_TAG = "SD CARD:";

wd_camera_settings_t deafultCameraSettings = {
    .resolution = WD_CAM_RES_800x600,
};

wd_camera_capture_time_settings_t defaultCaptureTimeSettings = {
    .startTime.second    = 0,
    .startTime.minute    = 0,
    .startTime.hour      = 9,
    .endTime.second      = 0,
    .endTime.minute      = 0,
    .endTime.hour        = 18,
    .intervalTime.second = 0,
    .intervalTime.minute = 0,
    .intervalTime.hour   = 2,
};

/* Private Variables */
int mounted          = FALSE;
uint16_t imageNumber = 0;

// Options for mounting the SD Card are given in the following
// configuration
static esp_vfs_fat_sdmmc_mount_config_t sdCardConfiguration = {
    .format_if_mount_failed = false,
    .max_files              = 5,
    .allocation_unit_size   = 16 * 1024,
};

sdmmc_card_t* card;

/* Private Function Declarations */
uint8_t sd_card_check_file_path_exists(char* filePath);
uint8_t sd_card_check_directory_exists(char* directory);

/* GOOD FUNCTIONS */

uint8_t sd_card_open_file(FILE** file, char* filePath, uint8_t code, char* errMsg) {

    char* settings = (code == SD_CARD_FILE_READ) ? "rb\0" : "r+b\0";

    if ((*file = fopen(filePath, settings)) != NULL) {
        return TRUE;
    }

    sprintf(errMsg, "Failed to open file %s. Error: '%s'\r\n", filePath, strerror(errno));
    return FALSE;
}

uint8_t sd_card_create_file(char* filePath, char* errMsg) {

    FILE* file;
    if ((file = fopen(filePath, "ab+")) == NULL) {
        sprintf(errMsg, "Failed to open file %s. Error: '%s'\r\n", filePath, strerror(errno));
        return FALSE;
    }

    fclose(file);
    return TRUE;
}

uint8_t sd_card_get_file_size(char* filePath, uint32_t* numBytes, char* errMsg) {

    FILE* file;

    // Try open the filepath in read mode
    if (sd_card_open_file(&file, filePath, SD_CARD_FILE_READ, errMsg) != TRUE) {
        return FALSE;
    }

    // Set pointer to end of the file
    fseek(file, 0L, SEEK_END);

    // Get the file length in bytes
    *numBytes = ftell(file);

    // Set file pointer to start of file
    fseek(file, 0L, SEEK_SET);

    fclose(file);

    return TRUE;
}

uint8_t sd_card_create_path(char* folderPath, bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card could not open\n");
        return FALSE;
    }

    // Validate the path length
    if (chars_get_num_bytes(folderPath) > MAX_PATH_LENGTH) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Folder path > 50 characters\n");
        return FALSE;
    }

    // Try create folder
    char path[MAX_PATH_LENGTH + 1];
    struct stat st = {0};
    int fileFound  = 0;
    for (int i = 0; folderPath[i] != '\0'; i++) {

        path[i] = folderPath[i];

        // Finding a . signifies there are no more folders to be made, only one file
        if (path[i] == '.') {
            fileFound = 1;
        }

        if (path[i] == '/' || folderPath[i + 1] == '\0') {

            path[i + (folderPath[i + 1] == '\0')] = '\0';

            // Add SD card mount point to start of path
            char directory[MAX_PATH_LENGTH + 9];
            sprintf(directory, "%s/%s", MOUNT_POINT_PATH, path);

            // Try create the file if the end of the path is a file
            if (fileFound) {
                FILE* file = fopen(directory, "w");

                if (file == NULL) {
                    bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                                      "File could not be made\n");
                    return FALSE;
                }

                break;
            }

            // Error if the directory does not exist and a new one could not be made
            if (stat(directory, &st) != 0 && mkdir(directory, 0700) != 0) {
                bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Dir could not be made\n");
                return FALSE;
            }

            path[i] = '/';
        }
    }

    // For some reason, creating a success packet here would stuff up. Testing showed that the code halted on the
    // line bpacket->sender = sender; I have no idea why this is the case. Simplest fix was to just comment out the
    // code. These result occured when testing the read settings function
    // if (bpacket_create_p(&response, sender, receiver, request, BPACKET_CODE_SUCCESS, 0, NULL) != TRUE) {
    //     bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
    //                       "CP: Setting bpacket failed!\r\n\0");
    //     esp32_uart_send_bpacket(&b1);
    // }

    return TRUE;
}

uint8_t sd_card_list_directory(bpacket_t* bpacket, bpacket_char_array_t* bpacketCharArray) {

    // Save address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    char* folderPath = bpacketCharArray->string;

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card could not open\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

