gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    return TRUE;
}

uint8_t sd_card_save_image(uint8_t* imageData, int imageLength, bpacket_t* bpacket) {

    // Save the address
    uint8_t request  = bpacket->request;
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Extract the RTC and temperatre data from the bpacket
    ds18b20_temp_t temp1, temp2;
    dt_datetime_t datetime;
    uint8_t result = wd_bpacket_to_photo_data(bpacket, &datetime, &temp1, &temp2);

    if (result != TRUE) {
        char err[50];
        wd_get_error(result, err);
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_IN_PROGRESS, err);
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    // Try open the SD card
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Could not open the SD card\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    // // Create the data folder path if required
    // if (sd_card_create_path(IMAGE_DATA_FOLDER, bpacket) != TRUE) {
    //     bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
    //                       "Could not create path to data folder\0");
    //     esp32_uart_send_bpacket(bpacket);
    //     return FALSE;
    // }

    // Create formatted image number in the format of xxx
    char imgNumString[8];
    sprintf(imgNumString, "%s%s%i", (imageNumber < 100) ? "0" : "", (imageNumber < 10) ? "0" : "", imageNumber);

    // Create formatted date time in the format yymmdd_hhmm
    char datetimeString[40];
    sprintf(datetimeString, "%i%s%i%s%i_%s%i%s%i", datetime.date.year - 2000, datetime.date.month < 10 ? "0" : "",
            datetime.date.month, datetime.date.day < 10 ? "0" : "", datetime.date.day,
            datetime.time.hour < 10 ? "0" : "", datetime.time.hour, datetime.time.minute < 10 ? "0" : "",
            datetime.time.minute);

    // Create path for image
    char filePath[80];
    sprintf(filePath, "%s/%s/img%s_%s.jpg", MOUNT_POINT_PATH, IMAGE_DATA_FOLDER, imgNumString, datetimeString);

    FILE* imageFile = fopen(filePath, "wb");
    if (imageFile == NULL) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Image file failed to open\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    for (int i = 0; i < imageLength; i++) {
        fputc(imageData[i], imageFile);
    }

    fclose(imageFile);

    imageNumber++;

    // Save the temperature data
    if (sd_card_add_temp_to_csv(datetime, temp1, temp2) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "Failed to save temperature data\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    return TRUE;
}

uint8_t sd_card_init(bpacket_t* bpacket) {

    // Update the image number
    if (sd_card_search_num_images(&imageNumber, bpacket) != TRUE) {
        return FALSE;
    }

    return TRUE;
}

void sd_card_copy_file(bpacket_t* bpacket, bpacket_char_array_t* bpacketCharArray) {

    // Save the address
    uint8_t receiver = bpacket->receiver;
    uint8_t sender   = bpacket->sender;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR,
                          "SD card failed to open\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Return an error if there was no specified file
    if (bpacketCharArray->string[0] == '\0') {
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR,
                          "No file was specified\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    // Max file length is 50
    uint16_t filePathNameSize = chars_get_num_bytes(bpacketCharArray->string);

    if (filePathNameSize > (57)) { // including mount point which is current 7 bytes
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, "File path > 50\0");
        esp32_uart_send_bpacket(bpacket);
        return;
    }

    char filePath[filePathNameSize + 1]; // add one for null pointer!
    sprintf(filePath, "%s%s", MOUNT_POINT_PATH, bpacketCharArray->string);
    int i = 0;
    for (i = 0; i < filePathNameSize; i++) {
        filePath[i + 8] = bpacketCharArray->string[i];
    }
    filePath[i + 8] = '\0'; // Add null terminator

    // Get the length of the file
    uint32_t fileNumBytes;
    char errMsg[50];
    if (sd_card_get_file_size(filePath, &fileNumBytes, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, errMsg);
        esp32_uart_send_bpacket(bpacket);
        sd_card_close();
        return;
    }

    FILE* file;
    if (sd_card_open_file(&file, filePath, SD_CARD_FILE_READ, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, WATCHDOG_BPK_R_COPY_FILE, BPACKET_CODE_ERROR, errMsg);
        esp32_uart_send_bpacket(bpacket);
        sd_card_close();
        return;
    }

    // Change the values of the bpacket so they get sent to Maple
    bpacket->sender   = receiver;
    bpacket->receiver = sender;
    bpacket->code     = BPACKET_CODE_IN_PROGRESS;
    bpacket->numBytes = BPACKET_MAX_NUM_DATA_BYTES;
    int pi            = 0;

    for (uint32_t i = 0; i < fileNumBytes; i++) {

        bpacket->bytes[pi++] = fgetc(file);

        if (pi < BPACKET_MAX_NUM_DATA_BYTES && (i + 1) != fileNumBytes) {
            continue;
        }

        if ((i + 1) == fileNumBytes) {
            bpacket->code     = BPACKET_CODE_SUCCESS;
            bpacket->numBytes = pi--;
        }

        esp32_uart_send_bpacket(bpacket);

        pi = 0;
    }

    fclose(file);

    // Close the SD card
    sd_card_close();
}

uint8_t sd_card_write_settings(bpacket_t* bpacket) {

    bpacket_t b1;

    uint8_t sender   = bpacket->sender;
    uint8_t receiver = bpacket->receiver;
    uint8_t request  = bpacket->request;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card failed to open\r\n\0");
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    FILE* file;
    char errMsg[50];
    if (sd_card_open_file(&file, SETTINGS_FILE_PATH_START_AT_ROOT, SD_CARD_FILE_WRITE, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, errMsg);
        esp32_uart_send_bpacket(bpacket);
        sd_card_close();
        return FALSE;
    }

    switch (bpacket->request) {

