gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
        case WATCHDOG_BPK_R_SET_CAMERA_SETTINGS:;

            wd_camera_settings_t cameraSettings;
            if (wd_bpacket_to_camera_settings(bpacket, &cameraSettings) != TRUE) {
                bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                                  "Bpacket to camera settings failed. SD Card write attempt\r\n\0");
                esp32_uart_send_bpacket(bpacket);
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            fseek(file, 0L, SEEK_SET); // Ensure the file is pointing to first byte
            fputc(cameraSettings.resolution, file);

            char h[40];
            sprintf(h, "Camera settings set to %i\r\n", cameraSettings.resolution);
            bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, h);
            esp32_uart_send_bpacket(&b1);

            break;

        case WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS:;

            wd_camera_capture_time_settings_t captureTime;
            if (wd_bpacket_to_capture_time_settings(bpacket, &captureTime) != TRUE) {
                bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                                  "Bpacket to capture time settings failed. SD Card write attempt\r\n\0");
                // Clean up
                fclose(file);
                sd_card_close();
                return FALSE;
            }

            // Skip the first byte as this is where the camera resolution is stored
            fseek(file, 1, SEEK_CUR);
            fputc(captureTime.startTime.minute, file);
            fputc(captureTime.startTime.hour, file);
            fputc(captureTime.endTime.minute, file);
            fputc(captureTime.endTime.hour, file);
            fputc(captureTime.intervalTime.minute, file);
            fputc(captureTime.intervalTime.hour, file);

            break;

        default:;

            bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "WF: Invalid request!\r\n\0");
            esp32_uart_send_bpacket(bpacket);
            return FALSE;
    }

    // Clean up
    fclose(file);
    sd_card_close();

    // Update bpacket to send as success response back
    bpacket->numBytes = 0;
    bpacket->receiver = sender;
    bpacket->sender   = receiver;
    bpacket->code     = BPACKET_CODE_SUCCESS;

    bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                      "Leaving write settings\r\n\0");
    esp32_uart_send_bpacket(&b1);

    return TRUE;
}

uint8_t sd_card_format_sd_card(bpacket_t* bpacket) {

    char errMsg[50];
    bpacket_t b1;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                          "SD card failed to open\r\n\0");
        return FALSE;
    }

    /****** START CODE BLOCK ******/
    // Description: Confirm all the correct folders on the SD card exist

    // Create watchdog folder if necessary
    if (sd_card_create_path(WATCHDOG_FOLDER_PATH, bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create data folder if necessary
    if (sd_card_create_path(DATA_FOLDER_PATH, bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create logs folder if necessary
    if (sd_card_create_path(LOG_FOLDER_PATH, bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Create settings folder if necessary
    if (sd_card_create_path(SETTINGS_FOLDER_PATH, bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    /****** END CODE BLOCK ******/

    /****** START CODE BLOCK ******/
    // Description: Confirm the settings file exists and that it has valid data

    // Create the settings file if required
    if (sd_card_create_file(SETTINGS_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_ERROR, errMsg);
        return FALSE;
    }

    uint32_t numBytes = 0;

    // Write default settings to settings file the file is empty
    if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &numBytes, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR, errMsg);
        sd_card_close();
        return FALSE;
    }

    if (numBytes == 0) {

        // Write the default camera settings to the SD card
        bpacket_t cSettings;
        if (wd_camera_settings_to_bpacket(&cSettings, bpacket->receiver, bpacket->sender,
                                          WATCHDOG_BPK_R_SET_CAMERA_SETTINGS, BPACKET_CODE_EXECUTE,
                                          &deafultCameraSettings) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Failed setting default camera settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        if (sd_card_write_settings(&cSettings) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Failed setting default camera settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        // Write the default capture time settings to the SD card
        bpacket_t ctSettings;
        if (wd_capture_time_settings_to_bpacket(&ctSettings, bpacket->receiver, bpacket->sender,
                                                WATCHDOG_BPK_R_SET_CAPTURE_TIME_SETTINGS, BPACKET_CODE_EXECUTE,
                                                &defaultCaptureTimeSettings) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Failed setting default capture time settings\r\n\0");
            sd_card_close();
            return FALSE;
        }

        if (sd_card_write_settings(&ctSettings) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Settings default capture time settings failed\r\n\0");
            sd_card_close();
            return FALSE;
        }
    }

    /****** END CODE BLOCK ******/

