gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
    /****** START CODE BLOCK ******/
    // Description: Confirm the log and data files exist

    // Create the data file if required
    if (sd_card_create_file(DATA_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_ERROR, errMsg);
        return FALSE;
    }

    // Create the logs file if required
    if (sd_card_create_file(LOG_FILE_PATH_START_AT_ROOT, errMsg) != TRUE) {
        bpacket_create_sp(&b1, bpacket->sender, bpacket->receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_ERROR, errMsg);
        return FALSE;
    }

    /****** END CODE BLOCK ******/

    sd_card_close();

    return TRUE;
}

uint8_t sd_card_read_settings(bpacket_t* bpacket) {

    // Save the sender, receiver and request so that if the bpacket values get changed
    // this doesn't alter the sender, receiver, request of any other bpacket message
    // that might need to be sent from this function.
    uint8_t sender   = bpacket->sender;
    uint8_t receiver = bpacket->receiver;
    uint8_t request  = bpacket->request;

    bpacket_t b1;

    // Return error message if the SD card cannot be opened
    if (sd_card_open() != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card failed to open\r\n\0");
        return FALSE;
    }

    // Confirm the file path to the settings exists
    if (sd_card_create_path(SETTINGS_FOLDER_PATH, bpacket) != TRUE) {
        sd_card_close();
        return FALSE;
    }

    // Get the file size of the settings file. This needs to be done first because the file
    // needs to be opened in read mode
    uint32_t fileNumBytes = 0;
    char errMsg[50];
    if (sd_card_get_file_size(SETTINGS_FILE_PATH_START_AT_ROOT, &fileNumBytes, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, errMsg);
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    if (fileNumBytes == 0) {

        switch (bpacket->request) {

            case WATCHDOG_BPK_R_GET_CAMERA_SETTINGS:;

                bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                  "RF: 0 bytes req was camera settings\r\n\0");
                esp32_uart_send_bpacket(&b1);

                bpacket_t camSettingsBpacket;
                if (wd_camera_settings_to_bpacket(&camSettingsBpacket, receiver, sender,
                                                  WATCHDOG_BPK_R_SET_CAMERA_SETTINGS, BPACKET_CODE_EXECUTE,
                                                  &deafultCameraSettings) != TRUE) {
                    bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                                      "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(bpacket);
                    return FALSE;
                }

                if (sd_card_write_settings(&camSettingsBpacket) != TRUE) {
                    bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                      "FAILED TO WRITE SETTINGS CORRECTLY\r\n\0");
                    esp32_uart_send_bpacket(&b1);
                } else {
                    bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                                      "WROTE SETTINGS CORECTLY\r\n\0");
                    esp32_uart_send_bpacket(&b1);
                }
                break;

            case WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS:;

                bpacket_t deafultCaptureTimeSettingsBpacket;

                if (wd_capture_time_settings_to_bpacket(&deafultCaptureTimeSettingsBpacket, receiver, sender, request,
                                                        BPACKET_CODE_EXECUTE, &defaultCaptureTimeSettings) != TRUE) {
                    bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR,
                                      "Setting deafult camera settings failed\r\n\0");
                    esp32_uart_send_bpacket(bpacket);
                    return FALSE;
                }

                sd_card_write_settings(&deafultCaptureTimeSettingsBpacket);

                break;

            default:;

                bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "RF: Invalid request!\r\n\0");
                esp32_uart_send_bpacket(bpacket);
                return FALSE;
        }

        // Open the SD card again
        if (sd_card_open() != TRUE) {
            bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, "SD card failed to open\r\n\0");
            return FALSE;
        }
    }

    FILE* file;
    if (sd_card_open_file(&file, SETTINGS_FILE_PATH_START_AT_ROOT, SD_CARD_FILE_READ, errMsg) != TRUE) {
        bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, errMsg);
        esp32_uart_send_bpacket(bpacket);
        return FALSE;
    }

    if (bpacket->request == WATCHDOG_BPK_R_GET_CAMERA_SETTINGS) {

        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Request get camera settings\r\n\0");
        esp32_uart_send_bpacket(&b1);

        wd_camera_settings_t cameraSettings;
        cameraSettings.resolution = (uint8_t)fgetc(file);

        char j[70];
        sprintf(j, "RF: Resolution read: %i\r\n", cameraSettings.resolution);
        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, j);
        esp32_uart_send_bpacket(&b1);

        uint8_t result =
            wd_camera_settings_to_bpacket(bpacket, sender, receiver, request, BPACKET_CODE_SUCCESS, &cameraSettings);

        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Checking results\r\n\0");
        esp32_uart_send_bpacket(&b1);
        if (result != TRUE) {
            char errMsg[50];
            wd_get_error(result, errMsg);
            sprintf(j, "FAILED CRES: %i %s\r\n", result, errMsg);
            bpacket_create_sp(bpacket, sender, receiver, request, BPACKET_CODE_ERROR, j);
            esp32_uart_send_bpacket(bpacket);

            // Clean up
            fclose(file);
            sd_card_close();
            return FALSE;
        }

