gianbartadougall/WatchDog-ESP32/ESP32_CAM/main/Src/sd_card.c
        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Converted settings to bpacket\r\n\0");
        esp32_uart_send_bpacket(&b1);
    }

    if (bpacket->request == WATCHDOG_BPK_R_GET_CAPTURE_TIME_SETTINGS) {

        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "RF: Request get capture time\r\n\0");
        esp32_uart_send_bpacket(&b1);

        // Set the cursor to the 1st index to skip the camera settings
        fseek(file, 1, SEEK_CUR);
        wd_camera_capture_time_settings_t captureTime;
        // Seconds are required to be set to default otherwise they will assume
        // the values of whatever is stored in that memory and will fail when
        // being converted from a capture time to bpacket
        captureTime.startTime.second    = 0;
        captureTime.startTime.minute    = fgetc(file);
        captureTime.startTime.hour      = fgetc(file);
        captureTime.endTime.second      = 0;
        captureTime.endTime.minute      = fgetc(file);
        captureTime.endTime.hour        = fgetc(file);
        captureTime.intervalTime.second = 0;
        captureTime.intervalTime.minute = fgetc(file);
        captureTime.intervalTime.hour   = fgetc(file);

        if (wd_capture_time_settings_to_bpacket(bpacket, sender, receiver, request, BPACKET_CODE_SUCCESS,
                                                &captureTime) != TRUE) {
            bpacket_create_sp(bpacket, bpacket->sender, bpacket->receiver, bpacket->request, BPACKET_CODE_ERROR,
                              "Capture time settings to bpacket failed. SD Card read\r\n\0");

            // Clean up
            fclose(file);
            sd_card_close();
            return FALSE;
        }

        bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS,
                          "Capture time read\r\n\0");
        esp32_uart_send_bpacket(&b1);
    }

    // Clean up
    fclose(file);
    sd_card_close();

    bpacket_create_sp(&b1, sender, receiver, BPACKET_GEN_R_MESSAGE, BPACKET_CODE_SUCCESS, "RF: Closing up!\r\n\0");
    esp32_uart_send_bpacket(&b1);

    return TRUE;
}

uint8_t sd_card_get_camera_settings(wd_camera_settings_t* cameraSettings) {

    // Create a bpacket with the correct information to read camera settings
    bpacket_t bpacket;
    bpacket_create_p(&bpacket, BPACKET_ADDRESS_ESP32, BPACKET_ADDRESS_MAPLE, WATCHDOG_BPK_R_GET_CAMERA_SETTINGS,
                     BPACKET_CODE_EXECUTE, 0, NULL);

    if (sd_card_read_settings(&bpacket) != TRUE) {
        bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE,
                          BPACKET_CODE_ERROR, "CS: Failed to read camera settings\r\n\0");
        esp32_uart_send_bpacket(&bpacket);
        return FALSE;
    }

    // Convert the bpacket to camera settings
    if (wd_bpacket_to_camera_settings(&bpacket, cameraSettings) != TRUE) {
        bpacket_create_sp(&bpacket, BPACKET_ADDRESS_MAPLE, BPACKET_ADDRESS_ESP32, BPACKET_GEN_R_MESSAGE,
                          BPACKET_CODE_ERROR, "CS: Failed to parse camera settings\r\n\0");
        esp32_uart_send_bpacket(&bpacket);
        return FALSE;
    }

    return TRUE;
}

/* GOOD FUNCTIONS */

uint8_t sd_card_open(void) {

    // Return if the sd card has already been mounted
    if (mounted != FALSE) {
        return TRUE;
    }

    sdmmc_host_t host = SDMMC_HOST_DEFAULT();

    // This initializes the slot without card detect (CD) and write protect (WP) signals.
    // Modify slot_config.gpio_cd and slot_config.gpio_wp if your board has these signals.
    sdmmc_slot_config_t slot_config = SDMMC_SLOT_CONFIG_DEFAULT();
    slot_config.width               = 1;

    // Enable internal pullups on enabled pins. The internal pullups
    // are insufficient however, please make sure 10k external pullups are
    // connected on the bus. This is for debug / example purpose only.
    slot_config.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;

    // Mount the SD card
    esp_err_t ret = esp_vfs_fat_sdmmc_mount(MOUNT_POINT_PATH, &host, &slot_config, &sdCardConfiguration, &card);

    if (ret != ESP_OK) {

        if (ret == ESP_FAIL) {
            ESP_LOGE(SD_CARD_TAG, "Please reformat SD card");
            return SD_CARD_ERROR_UNREADABLE_CARD;
        }

        ESP_LOGE(SD_CARD_TAG, "SD card could not be connected");
        return SD_CARD_ERROR_CONNECTION_FAILURE;
    }

    // Log SD Card information
    char sdCardLog[LOG_MSG_MAX_CHARACTERS];
    if (card->max_freq_khz < 1000) {
        sprintf(sdCardLog, "SD CARD mounted. Speed: %dkhz\t", card->max_freq_khz);
    } else {
        sprintf(sdCardLog, "SD CARD mounted. Speed: %dMhz\t", card->max_freq_khz / 1000);
    }

    int returnCode = sd_card_log(SYSTEM_LOG_FILE, sdCardLog);
    if (returnCode != TRUE) {
        if (returnCode == SD_CARD_ERROR_IO_ERROR) {
            ESP_LOGE(SD_CARD_TAG, "Could not open file to write");
        }

        if (returnCode == LOG_ERR_MSG_TOO_LONG) {
            ESP_LOGE(SD_CARD_TAG, "Message was too long!");
        }
    }

    mounted = TRUE;
    return TRUE;
}

void sd_card_close(void) {

    if (mounted != TRUE) {
        return;
    }

    // Log the SD card being disabled
    char msg[40];
    sprintf(msg, "Unmounting SD card");
    sd_card_log(SYSTEM_LOG_FILE, msg);

    // All done, unmount partition and disable SDMMC peripheral
    esp_vfs_fat_sdcard_unmount(MOUNT_POINT_PATH, card);

    // ESP_LOGI(SD_CARD_TAG, "Card unmounted");
    mounted = FALSE;
}

uint8_t sd_card_check_file_path_exists(char* filePath) {

    // Get the length of the string
    int length = 0;
    char c;
    while ((c = filePath[length]) && (c != '\0')) {
        length++;
    }

    // Loop through file path string. Confirming each directory exists
    // as the file path string is being looped through. If a directory
    // doesn't exist, it is created immediatley
    char copyFilePath[length + 1];
    for (int i = 0; i < length; i++) {

        // Copy character from file path
        copyFilePath[i] = filePath[i];

        if (filePath[i + 1] == '/' || i == (length - 1)) {
            copyFilePath[i + 1] = '\0'; // Add null terminator to string
            if (sd_card_check_directory_exists(copyFilePath) != TRUE) {
                return FALSE;
            }
        }
    }

